{
    "<pad>": 0,
    "<s>": 1,
    "</s>": 2,
    "<unk>": 3,
    "public": 4,
    "static": 5,
    "@NotNull": 6,
    "GameMap": 7,
    "loadGameMap(@NotNull": 8,
    "Path": 9,
    "mapFile)": 10,
    "throws": 11,
    "IOException": 12,
    "{": 13,
    "final": 14,
    "var": 15,
    "fileContent": 16,
    "=": 17,
    "Files.readString(mapFile);": 18,
    "return": 19,
    "GameMap.parse(fileContent);": 20,
    "}": 21,
    "void": 22,
    "testLoadFromFile()": 23,
    "mapFile": 24,
    "tempDir.resolve(\"tempMap.map\");": 25,
    "String": 26,
    "rectangularMap": 27,
    "\"\"\"": 28,
    "233": 29,
    "######": 30,
    "#A..@#": 31,
    "#...@#": 32,
    "#....#": 33,
    "#.a..#": 34,
    "#..a.#": 35,
    "\"\"\";": 36,
    "Files.writeString(mapFile,": 37,
    "rectangularMap);": 38,
    "gameMap": 39,
    "SokobanGameFactory.loadGameMap(mapFile);": 40,
    "Position": 41,
    "of(int": 42,
    "x,": 43,
    "int": 44,
    "y)": 45,
    "new": 46,
    "Position(x,": 47,
    "y);": 48,
    "Left(int": 49,
    "initiator)": 50,
    "super(initiator);": 51,
    "moveLeft()": 52,
    "Position.of(232,": 53,
    "233),": 54,
    "Move.Left(-1).nextPosition(pos)": 55,
    ");": 56,
    "testShouldStopWhenWin()": 57,
    "gameState": 58,
    "mock(GameState.class);": 59,
    "when(gameState.isWin()).thenReturn(true);": 60,
    "game": 61,
    "SokobanGameForTesting(gameState);": 62,
    "GameState(@NotNull": 63,
    "map)": 64,
    "//": 65,
    "TODO": 66,
    "this.map": 67,
    "map;": 68,
    "this.initialAllPlayerPosition": 69,
    "this.getCurrentPlayerPosition(this.map.playerPositionMap);": 70,
    "this.initialGameBoard": 71,
    "this.getCurrentGameBoard(this.map.gameBoardMap);": 72,
    "this.map.undoLimit": 73,
    "this.getUndoQuota().get();": 74,
    "Down(int": 75,
    "testMove()": 76,
    "mapText": 77,
    "#a...#": 78,
    "testMap": 79,
    "TestHelper.parseGameMap(mapText);": 80,
    "spy(new": 81,
    "GameState(testMap));": 82,
    "result": 83,
    "game.feedActionForProcessing(new": 84,
    "Move.Down(0));": 85,
    "verify(gameState,": 86,
    "times(1)).move(any(),": 87,
    "any());": 88,
    "testPushBox()": 89,
    "times(2)).move(any(),": 90,
    "times(1)).checkpoint();": 91,
    "testHitWall()": 92,
    "##...#": 93,
    "never()).move(any(),": 94,
    "@Nullable": 95,
    "Entity": 96,
    "getEntity(@NotNull": 97,
    "position)": 98,
    "this.map.getEntity(position);": 99,
    "/**": 100,
    "*": 101,
    "Get": 102,
    "all": 103,
    "box": 104,
    "destination": 105,
    "positions": 106,
    "as": 107,
    "a": 108,
    "set": 109,
    "in": 110,
    "the": 111,
    "map.": 112,
    "This": 113,
    "should": 114,
    "be": 115,
    "same": 116,
    "that": 117,
    "{@link": 118,
    "GameMap}": 119,
    "testBoxParsing()": 120,
    "TestHelper.parseGameMap(rectangularMap);": 121,
    "assertInstanceOf(Box.class,": 122,
    "gameMap.getEntity(Position.of(2,": 123,
    "4)));": 124,
    "testPlayerParsing()": 125,
    "player": 126,
    "assertInstanceOf(Player.class,": 127,
    "gameMap.getEntity(Position.of(1,": 128,
    "1)));": 129,
    "testHeightForRectangularMap()": 130,
    "testWidthForRectangularMap()": 131,
    "testGetDestinations()": 132,
    "testWallParsing()": 133,
    "testGetEntity()": 134,
    "entity": 135,
    "gameMap.getEntity(Position.of(0,": 136,
    "0));": 137,
    "private": 138,
    "nonRectangularMap": 139,
    "#...@###": 140,
    "#a....@##": 141,
    "#.a.....#": 142,
    "#..a.####": 143,
    "testEmptyCellParsing()": 144,
    "TerminalInputEngine(InputStream": 145,
    "terminalStream)": 146,
    "this.terminalScanner": 147,
    "Scanner(terminalStream);": 148,
    "Action": 149,
    "fetchAction()": 150,
    "is": 151,
    "an": 152,
    "example": 153,
    "showing": 154,
    "how": 155,
    "to": 156,
    "read": 157,
    "line": 158,
    "from": 159,
    "Scanner": 160,
    "class.": 161,
    "Feel": 162,
    "free": 163,
    "change": 164,
    "it": 165,
    "if": 166,
    "you": 167,
    "do": 168,
    "not": 169,
    "like": 170,
    "it.": 171,
    "inputLine": 172,
    "terminalScanner.nextLine().toLowerCase();": 173,
    "switch": 174,
    "(inputLine)": 175,
    "case": 176,
    "\"exit\":": 177,
    "Exit(0)": 178,
    ";": 179,
    "\"u\":": 180,
    "Undo(0);": 181,
    "\"w\":": 182,
    "Move.Up(0);": 183,
    "\"a\":": 184,
    "Move.Left(0);": 185,
    "\"s\":": 186,
    "Move.Down(0);": 187,
    "\"d\":": 188,
    "Move.Right(0);": 189,
    "\"h\":": 190,
    "Move.Left(1);": 191,
    "\"j\":": 192,
    "Move.Down(1);": 193,
    "\"k\":": 194,
    "Move.Up(1);": 195,
    "\"l\":": 196,
    "Move.Right(1);": 197,
    "default:": 198,
    "InvalidInput(0,": 199,
    "\"Invalid": 200,
    "Input\");": 201,
    "testExit()": 202,
    "inputStream": 203,
    "fixValueStream(\"exit\");": 204,
    "inputEngine": 205,
    "TerminalInputEngine(inputStream);": 206,
    "action": 207,
    "inputEngine.fetchAction();": 208,
    "move(Position": 209,
    "from,": 210,
    "to)": 211,
    "newPosition": 212,
    "Position(to.x(),to.y());": 213,
    "currentPosition": 214,
    "Position(from.x(),from.y());": 215,
    "(this.map.gameBoardMap.get(currentPosition)": 216,
    "instanceof": 217,
    "Box)": 218,
    "currentGameBoard": 219,
    "currentPlayerPosition": 220,
    "else": 221,
    "//id:position": 222,
    "this.map.playerPositionMap.replace(((Player)": 223,
    "this.map.gameBoardMap.get(currentPosition)).getId(),newPosition);": 224,
    "//all": 225,
    "position": 226,
    "of": 227,
    "this.map.putEntity(newPosition,this.map.getEntity(currentPosition));": 228,
    "this.map.putEntity(currentPosition,new": 229,
    "Empty());": 230,
    "Record": 231,
    "checkpoint": 232,
    "state,": 233,
    "including:": 234,
    "<li>All": 235,
    "current": 236,
    "entities": 237,
    "map.</li>": 238,
    "<li>Current": 239,
    "undo": 240,
    "quota</li>": 241,
    "<p>": 242,
    "Checkpoint": 243,
    "used": 244,
    "GameState#undo()}": 245,
    "testWin()": 246,
    "TestHelper.parseGameMap(\"\"\"": 247,
    "#A.a@#": 248,
    "#..a@#": 249,
    "\"\"\");": 250,
    "GameState(testMap);": 251,
    "gameState.move(Position.of(3,": 252,
    "1),": 253,
    "Position.of(4,": 254,
    "1));": 255,
    "2),": 256,
    "2));": 257,
    "GameState(TestHelper.parseGameMap(\"\"\"": 258,
    "));": 259,
    "gameState.move(Position.of(1,": 260,
    "Position.of(2,": 261,
    "#.Aa@#": 262,
    "gameState.move(Position.of(2,": 263,
    "Position.of(3,": 264,
    "testGetUndoLimit()": 265,
    "testAllPlayerIds()": 266,
    "#APp@#": 267,
    "#xXa@@#": 268,
    "checkpoint()": 269,
    "this.playerCheckPoint.add(this.currentPlayerPosition);": 270,
    "this.checkPoint.add(this.currentGameBoard);": 271,
    "undo()": 272,
    "(this.map.undoLimit": 273,
    ">0": 274,
    "||": 275,
    "==": 276,
    "-1)": 277,
    "(this.checkPoint.size()": 278,
    "0)": 279,
    "this.map.playerPositionMap": 280,
    "this.getCurrentPlayerPosition(this.initialAllPlayerPosition);": 281,
    "this.map.gameBoardMap": 282,
    "this.getCurrentGameBoard(this.initialGameBoard);": 283,
    "!=": 284,
    "-=1;": 285,
    "this.getCurrentGameBoard(this.checkPoint.get(checkPoint.size()-1));": 286,
    "this.getCurrentPlayerPosition(this.playerCheckPoint.get(this.playerCheckPoint.size()-1));": 287,
    "this.checkPoint.remove(checkPoint.size()-1);": 288,
    "this.playerCheckPoint.remove(this.playerCheckPoint.size()-1);": 289,
    "maximum": 290,
    "width": 291,
    "testUndoWhenThereIsCheckpoint()": 292,
    "gameState.checkpoint();": 293,
    "gameState.undo();": 294,
    "InvalidInput(int": 295,
    "initiator,": 296,
    "message)": 297,
    "this.message": 298,
    "message;": 299,
    "Exit(int": 300,
    "TerminalSokobanGame(GameState": 301,
    "gameState,": 302,
    "TerminalInputEngine": 303,
    "inputEngine,": 304,
    "TerminalRenderingEngine": 305,
    "renderingEngine)": 306,
    "super(gameState);": 307,
    "this.inputEngine": 308,
    "inputEngine;": 309,
    "this.renderingEngine": 310,
    "renderingEngine;": 311,
    "Check": 312,
    "number": 313,
    "players": 314,
    "(gameState.getAllPlayerPositions().size()>2)": 315,
    "throw": 316,
    "NotImplementedException();": 317,
    "run()": 318,
    "this.renderingEngine.message(\"Sokoban": 319,
    "ready.\");": 320,
    "boolean": 321,
    "exit": 322,
    "false;": 323,
    "while": 324,
    "(!(this.shouldStop()))": 325,
    "this.renderingEngine.render(this.state);": 326,
    "this.renderingEngine.message(\"\");": 327,
    "undolimit": 328,
    "this.state.getUndoQuota().toString();": 329,
    "undolimit.substring(9,undolimit.length()-1);": 330,
    "this.renderingEngine.message(\"Undo": 331,
    "Quota:": 332,
    "\"": 333,
    "+": 334,
    "undolimit);": 335,
    "this.renderingEngine.message(\">>>\");": 336,
    "tempAction": 337,
    "this.inputEngine.fetchAction();": 338,
    "ActionResult": 339,
    "tempActionResult": 340,
    "this.processAction(tempAction);": 341,
    "(tempActionResult": 342,
    "ActionResult.Failed)": 343,
    "this.renderingEngine.message(((ActionResult.Failed)": 344,
    "tempActionResult).getReason());": 345,
    "(tempAction": 346,
    "Exit)": 347,
    "true;": 348,
    "this.renderingEngine.message(\"Game": 349,
    "exits.\");": 350,
    "(!exit)": 351,
    "this.renderingEngine.message(\"You": 352,
    "win.\");": 353,
    "testGameLoop()": 354,
    "mock(TerminalInputEngine.class);": 355,
    "renderingEngine": 356,
    "mock(TerminalRenderingEngine.class);": 357,
    "when(gameState.isWin()).thenReturn(false);": 358,
    "when(inputEngine.fetchAction())": 359,
    ".thenReturn(new": 360,
    "\"\"))": 361,
    "Exit(0));": 362,
    "TerminalSokobanGame(gameState,": 363,
    "renderingEngine);": 364,
    "game.run();": 365,
    "inOrder": 366,
    "inOrder(inputEngine,": 367,
    "Before": 368,
    "loop": 369,
    "inOrder.verify(renderingEngine).render(eq(gameState));": 370,
    "First": 371,
    "round": 372,
    "inOrder.verify(inputEngine).fetchAction();": 373,
    "Second": 374,
    "atLeastOnce()).getUndoQuota();": 375,
    "atLeast(0)).isWin();": 376,
    "verify(renderingEngine,": 377,
    "atLeastOnce()).message(any());": 378,
    "testTwoPlayers()": 379,
    "when(gameState.getAllPlayerPositions()).thenReturn(new": 380,
    "HashSet<>(Arrays.asList(Position.of(1,": 381,
    "Position.of(1,": 382,
    "2))));": 383,
    "TerminalRenderingEngine(PrintStream": 384,
    "outputSteam)": 385,
    "this.outputSteam": 386,
    "outputSteam;": 387,
    "message(@NotNull": 388,
    "content)": 389,
    "this.outputSteam.println(content);": 390,
    "Hint:": 391,
    "System.out": 392,
    "also": 393,
    "PrintStream.": 394,
    "testMessage()": 395,
    "stream": 396,
    "CapturingStream();": 397,
    "randomString": 398,
    "String.valueOf(this.hashCode());": 399,
    "TerminalRenderingEngine(stream);": 400,
    "renderingEngine.message(randomString);": 401,
    "testRender()": 402,
    "GameState(TestHelper.parseGameMap(testMap));": 403,
    "renderingEngine.render(gameState);": 404,
    "renderedContent": 405,
    "stream.getContent();": 406,
    "lines": 407,
    "renderedContent.lines().toList();": 408,
    "class": 409,
    "CapturingStream": 410,
    "extends": 411,
    "PrintStream": 412,
    "CapturingStream()": 413,
    "super(new": 414,
    "ByteArrayOutputStream());": 415,
    "getContent()": 416,
    "((ByteArrayOutputStream)": 417,
    "this.out).toString(StandardCharsets.UTF_8);": 418,
    "Up(int": 419,
    "moveUp()": 420,
    "Position.of(233,": 421,
    "232),": 422,
    "Move.Up(-1).nextPosition(pos)": 423,
    "moveDown()": 424,
    "234),": 425,
    "Move.Down(-1).nextPosition(pos)": 426,
    "Right(int": 427,
    "moveRight()": 428,
    "Position.of(234,": 429,
    "Move.Right(-1).nextPosition(pos)": 430,
    "Undo(int": 431,
    "testExceedingUndoQuota()": 432,
    "when(gameState.getPlayerPositionById(anyInt())).thenReturn(Position.of(0,": 433,
    "when(gameState.getUndoQuota()).thenReturn(Optional.of(0));": 434,
    "Undo(0));": 435,
    "testUndoUnlimited()": 436,
    "when(gameState.getUndoQuota()).thenReturn(Optional.empty());": 437,
    "for": 438,
    "(int": 439,
    "i": 440,
    "0;": 441,
    "<": 442,
    "10000;": 443,
    "i++)": 444,
    "times(10000)).undo();": 445,
    "testPushOtherPlayerBox()": 446,
    "#AB.@#": 447,
    "#b.a.#": 448,
    "#@...#": 449,
    "testMoveNonExistingPlayer()": 450,
    "Move.Down(23));": 451,
    "testCheckpointWhenNeed()": 452,
    ")));": 453,
    "Move.Right(0));": 454,
    "testPushBoxAgainstWall()": 455,
    "protected": 456,
    "processAction(@NotNull": 457,
    "action)": 458,
    "this.action": 459,
    "action;": 460,
    "switch(action)": 461,
    "Exit": 462,
    "e": 463,
    "->": 464,
    "ActionResult.Success(e);": 465,
    "InvalidInput": 466,
    "m": 467,
    "ActionResult.Failed(m,\"Invalid": 468,
    "Input.\");": 469,
    "Undo": 470,
    "u": 471,
    "(state.getUndoQuota().get()": 472,
    ">": 473,
    "0": 474,
    "state.getUndoQuota().get()": 475,
    "-1": 476,
    ")": 477,
    "this.state.undo();": 478,
    "ActionResult.Success(u);": 479,
    "ActionResult.Failed(u,\"You": 480,
    "have": 481,
    "run": 482,
    "out": 483,
    "your": 484,
    "quota.\");": 485,
    "Move": 486,
    "this.state.map.playerPositionMap.get(m.getInitiator());": 487,
    "nextPosition": 488,
    "m.nextPosition(currentPosition);": 489,
    "temp": 490,
    "this.state.map.gameBoardMap.get(nextPosition);": 491,
    "(": 492,
    "Wall)": 493,
    "ActionResult.Failed(m,\"You": 494,
    "hit": 495,
    "wall.\");": 496,
    "(temp": 497,
    "Player)": 498,
    "another": 499,
    "player.\");": 500,
    "(((Box)": 501,
    "temp).getPlayerId()": 502,
    "m.getInitiator())": 503,
    "cannot": 504,
    "move": 505,
    "other": 506,
    "players'": 507,
    "boxes.\");": 508,
    "nextX=": 509,
    "nextPosition.x();": 510,
    "nextY": 511,
    "nextPosition.y();": 512,
    "boxNextPosition": 513,
    "null;": 514,
    "(m)": 515,
    "Move.Left": 516,
    "left": 517,
    "Position(nextX-1,nextY);": 518,
    "(!": 519,
    "(this.state.map.gameBoardMap.get(boxNextPosition)instanceof": 520,
    "Empty))": 521,
    "ActionResult.Failed(m,\"Failed": 522,
    "push": 523,
    "box.\");": 524,
    "break;": 525,
    "Move.Right": 526,
    "right": 527,
    "Position(nextX+1,nextY);": 528,
    "Move.Down": 529,
    "down": 530,
    "Position(nextX,nextY+1);": 531,
    "Move.Up": 532,
    "up": 533,
    "Position(nextX,nextY-1);": 534,
    "default": 535,
    "IllegalArgumentException();": 536,
    "state.move(nextPosition,boxNextPosition);": 537,
    "state.move(currentPosition,nextPosition);": 538,
    "state.checkpoint();": 539,
    "ActionResult.Success(m);": 540,
    "testCheckpointWhenNotNeed()": 541,
    "never()).checkpoint();": 542,
    "SokobanGameForTesting": 543,
    "AbstractSokobanGame": 544,
    "SokobanGameForTesting(GameState": 545,
    "gameState)": 546,
    "@Override": 547,
    "feedActionForProcessing(Action": 548,
    "processAction(action);": 549,
    "testHitAnotherPlayer()": 550,
    "#B...#": 551,
    "#ab.@#": 552,
    "testUndoWithinQuota()": 553,
    "when(gameState.getUndoQuota()).thenReturn(Optional.of(1));": 554,
    "times(1)).undo();": 555,
    "testInvalidInput()": 556,
    "SokobanGameForTesting(mock(GameState.class));": 557,
    "message": 558,
    "String.valueOf(new": 559,
    "Random().nextLong());": 560,
    "InvalidInput(-1,": 561,
    "message);": 562,
    "game.feedActionForProcessing(action);": 563,
    "testUndoLimitParsing()": 564,
    "testWidthForNonRectangularMap()": 565,
    "TestHelper.parseGameMap(nonRectangularMap);": 566,
    "Set<Integer>": 567,
    "getPlayerIds()": 568,
    "this.playerId;": 569,
    "testTwoPlayersMap()": 570,
    "twoPlayersMap": 571,
    "#..B@#": 572,
    "#..b.#": 573,
    "TestHelper.parseGameMap(twoPlayersMap);": 574,
    "playerIds": 575,
    "gameMap.getPlayerIds();": 576,
    "expectedIds": 577,
    "HashSet<Integer>();": 578,
    "expectedIds.add(0);": 579,
    "expectedIds.add(1);": 580,
    "testMapWithoutPlayer()": 581,
    "invalidMap": 582,
    "###": 583,
    "#.#": 584,
    "@Tag(TestKind.HIDDEN)": 585,
    "@Test": 586,
    "testUnmatchedPlayersAndBoxes()": 587,
    "#a.b@#": 588,
    "#.a.@#": 589,
    "assertThrowsExactly(IllegalArgumentException.class,": 590,
    "()": 591,
    "TestHelper.parseGameMap(invalidMap));": 592,
    "testManyPlayersMap()": 593,
    "manyPlayersMap": 594,
    "#A.P@@#": 595,
    "#vCB@@#": 596,
    "#.cpD@#": 597,
    "#Ga.d@#": 598,
    "#g.bV@#": 599,
    "TestHelper.parseGameMap(manyPlayersMap);": 600,
    "HashSet<>(Arrays.asList(": 601,
    "0,": 602,
    "'P'": 603,
    "-": 604,
    "'A',": 605,
    "'C'": 606,
    "'B'": 607,
    "'D'": 608,
    "'G'": 609,
    "'V'": 610,
    "'A'": 611,
    "testHeightForNonRectangularMap()": 612,
    "testDuplicatedPlayers()": 613,
    "#..A@#": 614,
    "testParseMapWithoutUndoLimit()": 615,
    "String.join(\"n\",": 616,
    "rectangularMap.lines().skip(1).toList());": 617,
    "testInsufficientDestinations()": 618,
    "GameMap(int": 619,
    "maxWidth,": 620,
    "maxHeight,": 621,
    "Set<Position>": 622,
    "destinations,": 623,
    "undoLimit)": 624,
    "this.maxWidth": 625,
    "maxWidth;": 626,
    "this.maxHeight": 627,
    "maxHeight;": 628,
    "this.destinations": 629,
    "destinations;": 630,
    "this.undoLimit": 631,
    "undoLimit;": 632,
    "Parses": 633,
    "map": 634,
    "string": 635,
    "representation.": 636,
    "The": 637,
    "first": 638,
    "limit.": 639,
    "Starting": 640,
    "second": 641,
    "line,": 642,
    "represented": 643,
    "follows,": 644,
    "<li>#": 645,
    "represents": 646,
    "Wall}</li>": 647,
    "<li>@": 648,
    "destination.</li>": 649,
    "<li>Any": 650,
    "upper-case": 651,
    "letter": 652,
    "Player}.</li>": 653,
    "<li>": 654,
    "Any": 655,
    "lower-case": 656,
    "Box}": 657,
    "only": 658,
    "movable": 659,
    "by": 660,
    "with": 661,
    "corresponding": 662,
    "letter.": 663,
    "For": 664,
    "instance,": 665,
    "\"a\"": 666,
    "can": 667,
    "moved": 668,
    "\"A\"": 669,
    "and": 670,
    "\"B\".": 671,
    "</li>": 672,
    "<li>.": 673,
    "Empty}": 674,
    "map,": 675,
    "meaning": 676,
    "there": 677,
    "no": 678,
    "or": 679,
    "currently": 680,
    "at": 681,
    "this": 682,
    "position.</li>": 683,
    "Notes:": 684,
    "There": 685,
    "most": 686,
    "26": 687,
    "players.": 688,
    "All": 689,
    "implementations": 690,
    "classes": 691,
    "hk.ust.comp3021.game": 692,
    "package": 693,
    "support": 694,
    "simplicity,": 695,
    "we": 696,
    "assume": 697,
    "given": 698,
    "bounded": 699,
    "closed": 700,
    "boundary.": 701,
    "need": 702,
    "check": 703,
    "point.": 704,
    "Example": 705,
    "maps": 706,
    "found": 707,
    "\"src/main/resources\".": 708,
    "@param": 709,
    "@return": 710,
    "parsed": 711,
    "object.": 712,
    "@throws": 713,
    "IllegalArgumentException": 714,
    "limit": 715,
    "negative": 716,
    "but": 717,
    "-1.": 718,
    "are": 719,
    "multiple": 720,
    "letters,": 721,
    "i.e.,": 722,
    "one": 723,
    "exist": 724,
    "position.": 725,
    "boxes": 726,
    "equal": 727,
    "destinations.": 728,
    "whose": 729,
    "Box#getPlayerId()}": 730,
    "testSuperLargeMap()": 731,
    "try": 732,
    "GameMap(Integer.MAX_VALUE,": 733,
    "Integer.MAX_VALUE,": 734,
    "Collections.emptySet(),": 735,
    "0);": 736,
    "catch": 737,
    "(OutOfMemoryError": 738,
    "e)": 739,
    "RuntimeException(e);": 740,
    "});": 741,
    "testInvalidUndoLimit()": 742,
    "-233": 743,
    "testEmptyMap()": 744,
    "\"\";": 745,
    "testMove(String": 746,
    "input,": 747,
    "name,": 748,
    "playerId)": 749,
    "inputStreamU": 750,
    "fixValueStream(input.toUpperCase());": 751,
    "inputStreamL": 752,
    "fixValueStream(input.toLowerCase());": 753,
    "inputEngineU": 754,
    "TerminalInputEngine(inputStreamU);": 755,
    "inputEngineL": 756,
    "TerminalInputEngine(inputStreamL);": 757,
    "actionU": 758,
    "inputEngineU.fetchAction();": 759,
    "actionL": 760,
    "inputEngineL.fetchAction();": 761,
    "InputStream": 762,
    "fixValueStream(String": 763,
    "bytes": 764,
    "content.getBytes(StandardCharsets.UTF_8);": 765,
    "ByteArrayInputStream(bytes);": 766,
    "testUndo(String": 767,
    "fixValueStream(\"blah": 768,
    "blah\");": 769,
    "Box(int": 770,
    "this.playerId": 771,
    "playerId;": 772,
    "Player(int": 773,
    "id)": 774,
    "this.id": 775,
    "id;": 776,
    "ShouldNotReachException()": 777,
    "super(\"This": 778,
    "branch": 779,
    "reached.\");": 780,
    "testUndoWhenThereIsNoMove()": 781,
    "generateEntity(int": 782,
    "key)": 783,
    "(key": 784,
    "%": 785,
    "4)": 786,
    "Box(0);": 787,
    "1": 788,
    "Empty();": 789,
    "2": 790,
    "Player(0);": 791,
    "3": 792,
    "Wall();": 793,
    "ShouldNotReachException();": 794,
    "};": 795,
    "testGetUndoUnlimited()": 796,
    "putEntity(Position": 797,
    "position,": 798,
    "entity)": 799,
    "this.gameBoardMap.replace(position,entity);": 800,
    "testMapCopying()": 801,
    "maxWidth": 802,
    "2333;": 803,
    "maxHeight": 804,
    "random": 805,
    "Random();": 806,
    "randomEntities": 807,
    "Stream.generate(()": 808,
    "Position.of(random.nextInt(maxWidth),": 809,
    "random.nextInt(maxHeight)))": 810,
    ".distinct()": 811,
    ".limit(100)": 812,
    ".collect(Collectors.toMap(Function.identity(),": 813,
    "generateEntity(it.x())));": 814,
    "firstPos": 815,
    "randomEntities.keySet().stream().findFirst();": 816,
    "GameMap(maxWidth,": 817,
    "Collections.singleton(firstPos.get()),": 818,
    "233);": 819,
    "randomEntities.forEach(gameMap::putEntity);": 820,
    "GameState(gameMap);": 821,
    "randomPosition": 822,
    "randomEntities.keySet().stream().findAny();": 823,
    "gameMap.putEntity(randomPosition.get(),": 824,
    "randomEntities.forEach((p,": 825,
    "assertEquals(e,": 826,
    "gameState.getEntity(p)));": 827,
    "testUndoWhenThereIsMoveButNoCheckpoint()": 828,
    "testGameExit()": 829,
    "when(gameState.isWin()).thenReturn(false,": 830,
    "false,": 831,
    "false);": 832,
    "\"\"),": 833,
    "testGameWin()": 834,
    "true);": 835,
    "\"\"));": 836,
    "atLeastOnce()).isWin();": 837,
    "testMoreThanTwoPlayers()": 838,
    "3))));": 839,
    "undoQuota": 840,
    "map.getUndoLimit();": 841,
    "mapEntity": 842,
    "HashMap<>(map.mapEntity());": 843,
    "moveHistory.add(new": 844,
    "HashMap<>(mapEntity));": 845,
    "(Map.Entry<Position,": 846,
    "Entity>": 847,
    "entry": 848,
    ":": 849,
    "mapEntity.entrySet())": 850,
    "(entry.getKey().equals(position))": 851,
    "entry.getValue();": 852,
    "terminalScanner.nextLine();": 853,
    "id": 854,
    "-1;": 855,
    "playerOne": 856,
    "playerTwo": 857,
    "1;": 858,
    "lowerCaseInput": 859,
    "inputLine.toLowerCase();": 860,
    "(lowerCaseInput)": 861,
    "Move.Left(playerOne);": 862,
    "\"W\"": 863,
    "Move.Up(playerOne);": 864,
    "\"S\"": 865,
    "Move.Down(playerOne);": 866,
    "\"D\"": 867,
    "Move.Right(playerOne);": 868,
    "\"H\"": 869,
    "Move.Left(playerTwo);": 870,
    "\"J\"": 871,
    "Move.Down(playerTwo);": 872,
    "\"K\"": 873,
    "Move.Up(playerTwo);": 874,
    "\"L\"": 875,
    "Move.Right(playerTwo);": 876,
    "\"U\"": 877,
    "Undo(id);": 878,
    "EXIT_COMMAND_TEXT": 879,
    "Exit(id);": 880,
    "InvalidInput(id,": 881,
    "INVALID_INPUT_MESSAGE);": 882,
    "getEntity(from);": 883,
    "mapEntity.put(from,": 884,
    "mapEntity.put(to,": 885,
    "move);": 886,
    "(moveHistory.size()": 887,
    "1)": 888,
    "moveHistory.pop();": 889,
    "(!undoQuota.isEmpty())": 890,
    "Optional.of(undoQuota.get()": 891,
    "1);": 892,
    "HashMap<>(moveHistory.peek());": 893,
    "(gameState.getAllPlayerPositions().size()": 894,
    "2)": 895,
    "IllegalArgumentException(INVALID_INPUT_MESSAGE);": 896,
    "renderingEngine.message(GAME_READY_MESSAGE);": 897,
    "renderingEngine.render(state);": 898,
    "(!shouldStop())": 899,
    "quotaText;": 900,
    "(state.getUndoQuota().isEmpty())": 901,
    "quotaText": 902,
    "UNDO_QUOTA_UNLIMITED;": 903,
    "String.valueOf(state.getUndoQuota().get());": 904,
    "formatedQuotaText": 905,
    "String.format(UNDO_QUOTA_TEMPLATE,": 906,
    "quotaText);": 907,
    "renderingEngine.message(formatedQuotaText);": 908,
    "renderingEngine.message(\"Input(Player1:W/A/S/D,": 909,
    "Player2:H/J/K/L):\");": 910,
    "if(result": 911,
    "ActionResult.Failed){": 912,
    "renderingEngine.message(((ActionResult.Failed)": 913,
    "result).getReason());": 914,
    "renderingEngine.message(GAME_EXIT_MESSAGE);": 915,
    "(state.isWin())": 916,
    "renderingEngine.message(WIN_MESSAGE);": 917,
    "outputSteam.println(content);": 918,
    "(action){": 919,
    "ignored->new": 920,
    "ActionResult.Failed(action,": 921,
    "ignored->{": 922,
    "(state.getPlayerPositionById(action.getInitiator())": 923,
    "null)": 924,
    "yield": 925,
    "PLAYER_NOT_FOUND);": 926,
    "playerOriginalPosition": 927,
    "state.getPlayerPositionById(action.getInitiator());": 928,
    "playerDestinationPosition": 929,
    "((Move)": 930,
    "action).nextPosition(playerOriginalPosition);": 931,
    "originalEntity": 932,
    "state.getEntity(playerOriginalPosition);": 933,
    "nextEntity": 934,
    "state.getEntity(playerDestinationPosition);": 935,
    "(nextEntity": 936,
    "nextEntity).getPlayerId()": 937,
    "((Player)": 938,
    "originalEntity).getId())": 939,
    "\"You": 940,
    "boxes\");": 941,
    "positionBehindTheBox": 942,
    "action).nextPosition(playerDestinationPosition);": 943,
    "entityBehindTheBox": 944,
    "state.getEntity(positionBehindTheBox);": 945,
    "(entityBehindTheBox": 946,
    "Box": 947,
    "Player": 948,
    "\"Failed": 949,
    "box\");": 950,
    "state.move(playerDestinationPosition,": 951,
    "positionBehindTheBox);": 952,
    "state.move(playerOriginalPosition,": 953,
    "playerDestinationPosition);": 954,
    "ActionResult.Success(action);": 955,
    "player\");": 956,
    "wall\");": 957,
    "(state.getUndoQuota().isEmpty()": 958,
    "state.undo();": 959,
    "UNDO_QUOTA_RUN_OUT);": 960,
    "HashSet<>();": 961,
    "(Entity": 962,
    "mapEntity.values())": 963,
    "(entity": 964,
    "playerIds.add(((Player)": 965,
    "entity).getId());": 966,
    "playerIds;": 967,
    "this.width": 968,
    "this.height": 969,
    "mapEntity.put(position,": 970,
    "entity);": 971,
    "this.originalMap": 972,
    "this.grid": 973,
    "map.grid;": 974,
    "this.undoQuota": 975,
    "this.playersChar": 976,
    "ArrayList<>();": 977,
    "this.playersPos": 978,
    "deep": 979,
    "copy": 980,
    "so": 981,
    "originalMap": 982,
    "properties": 983,
    "changed": 984,
    "i=0;": 985,
    "i<map.playersChar.size();": 986,
    "i++){": 987,
    "this.playersChar.add(map.playersChar.get(i));": 988,
    "this.playersPos.add(map.playersPos.get(i));": 989,
    "this.boxesChar": 990,
    "this.boxesPos": 991,
    "i<map.boxesChar.size();": 992,
    "this.boxesChar.add(map.boxesChar.get(i));": 993,
    "this.boxesPos.add(map.boxesPos.get(i));": 994,
    "this.cpCount": 995,
    "TODOx:": 996,
    "test": 997,
    "this.grid[position.y()][position.x()];": 998,
    "(inputLine": 999,
    "StringResources.INVALID_INPUT_MESSAGE);": 1000,
    "playerid": 1001,
    "String[]": 1002,
    "inputs": 1003,
    "inputLine.split(\"s+\");": 1004,
    "https://www.geeksforgeeks.org/string-in-switch-case-in-java/": 1005,
    "(inputLine.toLowerCase()){": 1006,
    "StringResources.EXIT_COMMAND_TEXT:": 1007,
    "better": 1008,
    "place": 1009,
    "elsewhere?": 1010,
    "System.out.println(StringResources.GAME_EXIT_MESSAGE);": 1011,
    "Exit(0);": 1012,
    "InvalidInput(0,\"Invalid": 1013,
    "entFrom": 1014,
    "this.grid[from.y()][from.x()];": 1015,
    "this.grid[to.y()][to.x()]": 1016,
    "entFrom;": 1017,
    "this.grid[from.y()][from.x()]": 1018,
    "(entFrom": 1019,
    "Player){": 1020,
    "pid": 1021,
    "entFrom).getId();": 1022,
    "ix": 1023,
    "playersChar.indexOf((char)": 1024,
    "('A'+pid));": 1025,
    "playersPos.set(ix,": 1026,
    "to);": 1027,
    "((Box)": 1028,
    "entFrom).getPlayerId();": 1029,
    "boxesChar.indexOf((char)": 1030,
    "('a'+pid));": 1031,
    "boxesPos.set(ix,": 1032,
    "maxh": 1033,
    "this.originalMap.getMaxHeight();": 1034,
    "maxw": 1035,
    "this.originalMap.getMaxWidth();": 1036,
    "Entity[][]": 1037,
    "savegrid": 1038,
    "Entity[maxh][maxw];": 1039,
    "maxh;": 1040,
    "j": 1041,
    "maxw;": 1042,
    "j++)": 1043,
    "ent": 1044,
    "this.getEntity(new": 1045,
    "Position(j,": 1046,
    "i));": 1047,
    "(this.grid[i][j]": 1048,
    "Box){": 1049,
    "(Box)": 1050,
    "ent;": 1051,
    "savegrid[i][j]": 1052,
    "Box(box.getPlayerId());": 1053,
    "pla": 1054,
    "(Player)": 1055,
    "Box(pla.getId());": 1056,
    "Empty)": 1057,
    "List<Position>": 1058,
    "saveplaPos": 1059,
    "(Position": 1060,
    "p:playersPos){": 1061,
    "saveplaPos.add(new": 1062,
    "Position(p.x(),": 1063,
    "p.y()));": 1064,
    "saveboxPos": 1065,
    "p:boxesPos){": 1066,
    "saveboxPos.add(new": 1067,
    "System.out.println(\"checkpoint\");": 1068,
    "System.out.println(this.cpState.size());": 1069,
    "this.cpState.push(savegrid);": 1070,
    "this.plaPosState.push(saveplaPos);": 1071,
    "this.boxesPosState.push(saveboxPos);": 1072,
    "(this.undoQuota.get()": 1073,
    "1){": 1074,
    "System.out.println(\"run": 1075,
    "quota\");": 1076,
    "return;": 1077,
    "(this.cpState.empty()){": 1078,
    "System.out.println(\"no": 1079,
    "prev": 1080,
    "cp\");": 1081,
    "System.out.println(\"undoing\");": 1082,
    "System.out.println(this.getPlayerPositionById(0));": 1083,
    "[][])": 1084,
    "this.cpState.pop();": 1085,
    "this.plaPosState.pop();": 1086,
    "this.boxesPosState.pop();": 1087,
    "numPlayers": 1088,
    "gameState.getAllPlayerPositions().size();": 1089,
    "this.state": 1090,
    "gameState;": 1091,
    "isWin": 1092,
    "userinput": 1093,
    "(this.state.isWin()){": 1094,
    "TODOx": 1095,
    "outputSteam.print(content+System.lineSeparator());": 1096,
    "(action": 1097,
    "Exit){": 1098,
    "isExit": 1099,
    "InvalidInput)": 1100,
    "ActionResult.Failed((InvalidInput)": 1101,
    "action,": 1102,
    "input.\");": 1103,
    "Move)": 1104,
    "todo": 1105,
    "validity": 1106,
    "Move.Down){": 1107,
    "oldpos": 1108,
    "x": 1109,
    "oldpos.x();": 1110,
    "y": 1111,
    "oldpos.y();": 1112,
    "newpos": 1113,
    "y+1);": 1114,
    "newEnt": 1115,
    "state.getEntity(newpos);": 1116,
    "(newEnt": 1117,
    "Empty){": 1118,
    "state.move(oldpos,": 1119,
    "newpos);": 1120,
    "newpos2": 1121,
    "y+2);": 1122,
    "(state.getEntity(newpos2)": 1123,
    "System.out.println(\"moving\");": 1124,
    "state.move(newpos,": 1125,
    "newpos2);": 1126,
    "else{": 1127,
    "Move.Up){": 1128,
    "y-1);": 1129,
    "y-2);": 1130,
    "Move.Left){": 1131,
    "Position(x-1,": 1132,
    "Position(x-2,": 1133,
    "Move.Right){": 1134,
    "Position(x+1,": 1135,
    "Position(x+2,": 1136,
    "\"default": 1137,
    "invalid\");": 1138,
    "duplicate": 1139,
    "done": 1140,
    "on": 1141,
    ".parse": 1142,
    "ret": 1143,
    "i<": 1144,
    "playersPos.size();": 1145,
    "ret.add(i);": 1146,
    "ret;": 1147,
    "check:": 1148,
    "yet": 1149,
    "maybe": 1150,
    "replace": 1151,
    "grid": 1152,
    "placement": 1153,
    "active": 1154,
    "states": 1155,
    "grid[position.y()][position.x()]": 1156,
    "entity;": 1157,
    "curmap": 1158,
    "undoquota": 1159,
    "map.getUndoLimit().get();": 1160,
    "//throw": 1161,
    "curmap.getEntity(position);": 1162,
    "(inputLine){": 1163,
    "\"Exit\",": 1164,
    "\"W\":": 1165,
    "\"A\":": 1166,
    "\"S\":": 1167,
    "\"D\":": 1168,
    "\"H\":": 1169,
    "\"J\":": 1170,
    "\"K\":": 1171,
    "\"L\":": 1172,
    "\"U\",": 1173,
    "\"u\",": 1174,
    "\"undo\":": 1175,
    "input\");": 1176,
    "numplayer": 1177,
    "System.out.println(content);": 1178,
    "height": 1179,
    "destin": 1180,
    "undonumber": 1181,
    "numbox": 1182,
    "++;": 1183,
    "numplayer++;": 1184,
    "map.get(position.y()).set(position.x(),": 1185,
    "\"&\");": 1186,
    "String.valueOf((char)((Player)": 1187,
    "entity).getId()));": 1188,
    "String.valueOf((char)((Box)": 1189,
    "entity).getPlayerId()));": 1190,
    "\");": 1191,
    "this.gameMap": 1192,
    "history": 1193,
    "this.gameMap.getEntity(position);": 1194,
    "if(inputLine.equalsIgnoreCase(\"Exit\"))": 1195,
    "if(inputLine.equalsIgnoreCase(\"U\"))": 1196,
    "\"A\",": 1197,
    "\"S\",": 1198,
    "\"s\"": 1199,
    "\"W\",": 1200,
    "\"w\"": 1201,
    "\"D\",": 1202,
    "\"d\"": 1203,
    "\"H\",": 1204,
    "\"h\"": 1205,
    "\"J\",": 1206,
    "\"j\"": 1207,
    "\"K\",": 1208,
    "\"k\"": 1209,
    "\"L\",": 1210,
    "\"l\"": 1211,
    "result;": 1212,
    "fromT": 1213,
    "this.gameMap.getEntity(from);": 1214,
    "this.gameMap.putEntity(to,fromT);": 1215,
    "this.gameMap.putEntity(from,new": 1216,
    "this.history": 1217,
    "GameState(this);": 1218,
    "if(this.history": 1219,
    "null){": 1220,
    "if(undoQuota": 1221,
    "-1)undoQuota": 1222,
    "--;": 1223,
    "this.history.gameMap;": 1224,
    "this.history.history;": 1225,
    "this.gameMap.Map": 1226,
    "GameMap.OriginMap.clone();": 1227,
    "Numplayers": 1228,
    "if(Numplayers": 1229,
    "if(this.state.getUndoQuota().isPresent())this.renderingEngine.message(\"Undo": 1230,
    "(this.state.getUndoQuota().get()": 1231,
    "?": 1232,
    "\"unlimited\":this.state.getUndoQuota().get()));": 1233,
    "while(this.shouldStop()": 1234,
    "false){": 1235,
    "this.processAction(this.inputEngine.fetchAction());": 1236,
    "switch(result){": 1237,
    "ActionResult.Success": 1238,
    "ignored:": 1239,
    "ActionResult.Failed": 1240,
    "failed_:": 1241,
    "System.out.println(failed_.getReason());": 1242,
    "AR": 1243,
    "switch(action){": 1244,
    "ignored": 1245,
    "if(this.state.getUndoQuota().get()": 1246,
    "this.state.getUndoQuota().get()": 1247,
    "move_": 1248,
    "PlayerPos": 1249,
    "this.state.getPlayerPositionById(move_.getInitiator());": 1250,
    "NextPos": 1251,
    "move_.nextPosition(PlayerPos);": 1252,
    "this.state.getEntity(NextPos);": 1253,
    "switch(entity){": 1254,
    "Empty": 1255,
    "this.state.move(PlayerPos,": 1256,
    "NextPos);": 1257,
    "box_:": 1258,
    "if(box_.getPlayerId()": 1259,
    "action.getInitiator()){": 1260,
    "NextBoxPos": 1261,
    "move_.nextPosition(NextPos);": 1262,
    "if(this.state.isEmpty(NextBoxPos)){": 1263,
    "this.state.checkpoint();": 1264,
    "this.state.move(NextPos,": 1265,
    "NextBoxPos);": 1266,
    "ActionResult.Failed(action,\"Failed": 1267,
    "Wall": 1268,
    "ActionResult.Failed(action,\"You": 1269,
    "this.isExit": 1270,
    "\"Invaild": 1271,
    "AR;": 1272,
    "this.PlayerIds;": 1273,
    "position.x();": 1274,
    "position.y();": 1275,
    "box_": 1276,
    "this.Map[y]": 1277,
    "this.Map[y].substring(0,": 1278,
    "x)": 1279,
    "(char)(box_.getPlayerId()": 1280,
    "(int)'a')": 1281,
    "this.Map[y].substring(x+1);": 1282,
    "if(isDestination(position)": 1283,
    "false)": 1284,
    "'.'": 1285,
    "'@'": 1286,
    "player_": 1287,
    "(char)(player_.getId()": 1288,
    "(int)'A')": 1289,
    "'#'": 1290,
    "undoLeft=map.undo;": 1291,
    "ArrayList<Entity[][]>();": 1292,
    "Entity[map.height][map.width];": 1293,
    "System.out.print(map.height+\"\");": 1294,
    "i<map.height;": 1295,
    "for(int": 1296,
    "j=0;": 1297,
    "j<map.width;": 1298,
    "j++){": 1299,
    "temp[i][j]=map.entityArr[i][j];": 1300,
    "history.add(temp);": 1301,
    "System.out.print(\"originalmap:\"+temp);": 1302,
    "i<4;": 1303,
    "j<6;": 1304,
    "System.out.print(history.get(0)[i][j]);": 1305,
    "System.out.print(System.lineSeparator());": 1306,
    "originalMap.entityArr[position.y()][position.x()];": 1307,
    "splited": 1308,
    "originalMap.map.lines().toArray(String[]::new);": 1309,
    "////": 1310,
    "System.out.print(map);": 1311,
    "System.out.print(splited[position.y()+1].charAt(position.x()));": 1312,
    "checkchar": 1313,
    "(int)": 1314,
    "splited[position.y()+1].charAt(position.x());": 1315,
    "if(checkchar<91&&checkchar>64){": 1316,
    "Player(checkchar-65);": 1317,
    "System.out.print(checkchar);": 1318,
    "if(checkchar<123&&checkchar>96){": 1319,
    "Box(checkchar-97);": 1320,
    "if(checkchar==46){": 1321,
    "if(checkchar==35){": 1322,
    "System.out.print(inputLine);": 1323,
    "(inputLine.equals(\"A\")||inputLine.equals('a'))": 1324,
    "(inputLine.equals(\"D\")||inputLine.equals('d'))": 1325,
    "(inputLine.equals(\"W\")||inputLine.equals('w'))": 1326,
    "(inputLine.equals(\"S\")||inputLine.equals('s'))": 1327,
    "(inputLine.equals(\"H\")||inputLine.equals('h'))": 1328,
    "(inputLine.equals(\"L\")||inputLine.equals('l'))": 1329,
    "(inputLine.equals(\"K\")||inputLine.equals('k'))": 1330,
    "(inputLine.equals(\"J\")||inputLine.equals('j'))": 1331,
    "(inputLine.equals(\"U\")||inputLine.equals('u'))": 1332,
    "Undo(1);": 1333,
    "(inputLine.equals(\"exit\")||inputLine.equals(\"EXIT\"))": 1334,
    "Exit(1);": 1335,
    "System.out.print(\"error\");": 1336,
    "InvalidInput(0,INVALID_INPUT_MESSAGE);": 1337,
    "originalMap.entityArr[to.y()][to.x()]=originalMap.getEntity(from);": 1338,
    "originalMap.entityArr[from.y()][from.x()]=new": 1339,
    "moving": 1340,
    "originalMap.getEntity(from);": 1341,
    "originalMap.putEntity(to,moving);": 1342,
    "System.out.print(\"111new": 1343,
    "map:\");": 1344,
    "System.out.print(originalMap.map);": 1345,
    "tempMap": 1346,
    "originalMap;": 1347,
    "tempMap.putEntity(from,new": 1348,
    "System.out.print(\"222new": 1349,
    "System.out.print(tempMap.map);": 1350,
    "Entity[originalMap.height][originalMap.width];": 1351,
    "System.out.print(originalMap.height+\"\");": 1352,
    "i<originalMap.height;": 1353,
    "j<originalMap.width;": 1354,
    "temp[i][j]=originalMap.entityArr[i][j];": 1355,
    "System.out.print(\"history:": 1356,
    "\"+": 1357,
    "history);": 1358,
    "historyNum": 1359,
    "history.size();": 1360,
    "System.out.print(\"historysize:": 1361,
    "historyNum);": 1362,
    "if(history.get(0).equals(history.get(1)))System.out.print(\"equalssss\");": 1363,
    "System.out.print(\"notequal\");": 1364,
    "System.out.print(\"old": 1365,
    "history:": 1366,
    "originalMap.entityArr);": 1367,
    "originalMap.entityArr=history.get(historyNum-2);": 1368,
    "System.out.print(\"new": 1369,
    "System.out.print(history.get(1)[i][j]);": 1370,
    "undoLeft-=1;": 1371,
    "if(gameState.getAllPlayerPositions().size()>2)": 1372,
    "(!shouldStop()){": 1373,
    "renderingEngine.render(this.state);": 1374,
    "System.out.print(outputSteam);": 1375,
    "System.out.printf(content);": 1376,
    "outputSteam.append(content);": 1377,
    "outputSteam.append(System.lineSeparator());": 1378,
    "if(action": 1379,
    "Move){": 1380,
    "original": 1381,
    "Position(original.x(),": 1382,
    "original.y()+1);": 1383,
    "(state.getEntity(newPosition)": 1384,
    "\"hit": 1385,
    "state.getEntity(newPosition)).getPlayerId()==action.getInitiator()){": 1386,
    "newBoxPosition": 1387,
    "original.y()+2);": 1388,
    "(state.getEntity(newBoxPosition)": 1389,
    "state.move(newPosition,newBoxPosition);": 1390,
    "state.move(original,newPosition);": 1391,
    "original.y()-1);": 1392,
    "original.y()-2);": 1393,
    "Position(original.x()-1,": 1394,
    "original.y());": 1395,
    "Position(original.x()-2,": 1396,
    "Position(original.x()+1,": 1397,
    "Position(original.x()+2,": 1398,
    "Undo){": 1399,
    "ActionResult.Failed(action,INVALID_INPUT_MESSAGE);": 1400,
    "map.lines().toArray(String[]::new);": 1401,
    "System.out.print(splited.length);": 1402,
    "undoLimit": 1403,
    "Integer.parseInt(splited[0]);": 1404,
    "splited.length-1;": 1405,
    "splited[1].length();": 1406,
    "System.out.print(width);": 1407,
    "playerIDs": 1408,
    "i=1;": 1409,
    "i<height;": 1410,
    "j<width;": 1411,
    "if(splited[i].charAt(j)=='@'){": 1412,
    "boxPosition.add(new": 1413,
    "Position(j,i-1));": 1414,
    "Position(4,1));": 1415,
    "Position(4,2));": 1416,
    "GameMap(width,height,boxPosition,undoLimit);": 1417,
    "System.out.print(boxPosition);": 1418,
    "/////": 1419,
    "(undoLimit<-1)throw": 1420,
    "player[]": 1421,
    "int[26];": 1422,
    "playerBox[]": 1423,
    "noOfBox": 1424,
    "noOfBoxDestination": 1425,
    "i<26;": 1426,
    "player[i]=0;": 1427,
    "splited[i].charAt(j);": 1428,
    "playerIDs.add(checkchar-65);": 1429,
    "System.out.print(PlayerIDs);": 1430,
    "playerIDs;": 1431,
    "positions=destinations;": 1432,
    "undo=undoLimit;": 1433,
    "entityArr": 1434,
    "Entity[height][width];": 1435,
    "entityArr[height][width]=new": 1436,
    "char": 1437,
    "entityChar": 1438,
    "System.out.print(\"entity": 1439,
    "is:": 1440,
    "Wall);": 1441,
    "entityChar='#';": 1442,
    "entityChar=(char)(((Box)": 1443,
    "entity).getPlayerId()+97);": 1444,
    "entityChar=(char)(((Player)": 1445,
    "entity).getId()+65);": 1446,
    "entityChar='.';": 1447,
    "char[]": 1448,
    "splited[position.y()+1].toCharArray();": 1449,
    "System.out.print(temp);": 1450,
    "temp[position.x()]=": 1451,
    "entityChar;": 1452,
    "splited[position.y()+1]=new": 1453,
    "String(temp);": 1454,
    "System.out.print(new": 1455,
    "String(temp));": 1456,
    "line:\");": 1457,
    "System.out.print(splited[position.y()+1]);": 1458,
    "Arrays.toString(splited);": 1459,
    "i<height+1;": 1460,
    "System.out.print(\"yooyoyo\");": 1461,
    "map=map.concat(splited[i]);": 1462,
    "map=map.concat(\"System.lineSeparator()\");": 1463,
    "map=map.concat(System.lineSeparator());": 1464,
    "this.currentMap": 1465,
    "ArrayList<>(map.mapArrayList);": 1466,
    "this.remainingUndos": 1467,
    "map.undoLimit;": 1468,
    "this.checkpointMap": 1469,
    "ArrayList<>(currentMap);": 1470,
    "if(currentMap.get(position.y()).length()": 1471,
    "<=": 1472,
    "position.x()){return": 1473,
    "null;};": 1474,
    "switch(currentMap.get(position.y()).charAt(position.x()))": 1475,
    "'#':": 1476,
    "code": 1477,
    "block": 1478,
    "//break;": 1479,
    "'.':": 1480,
    "'@':": 1481,
    "Empty();//this.mapArrayList.get(position.y()).charAt(position.x()))": 1482,
    "'": 1483,
    "':": 1484,
    "if(Character.isUpperCase(currentMap.get(position.y()).charAt(position.x())))": 1485,
    "{return": 1486,
    "Player((int)(currentMap.get(position.y()).charAt(position.x())": 1487,
    "'A'));}": 1488,
    "(Character.isLowerCase(currentMap.get(position.y()).charAt(position.x())))": 1489,
    "Box((int)(currentMap.get(position.y()).charAt(position.x())": 1490,
    "'a'));": 1491,
    "\"w\":return": 1492,
    "\"a\":return": 1493,
    "\"s\":return": 1494,
    "\"d\":return": 1495,
    "\"h\":return": 1496,
    "\"j\":return": 1497,
    "\"k\":return": 1498,
    "\"l\":return": 1499,
    "\"u\":return": 1500,
    "if(Character.isLowerCase(currentMap.get(from.y()).charAt(from.x())))": 1501,
    "//this.checkpointMap": 1502,
    "ArrayList<>(this.currentMap);": 1503,
    "historyCheckPoints.add(new": 1504,
    "ArrayList<>(this.currentMap));": 1505,
    "//System.out.println(\"I": 1506,
    "reached": 1507,
    "here,": 1508,
    "stored": 1509,
    "=\");": 1510,
    "//for": 1511,
    "historyCheckPoints.get(0);i++)": 1512,
    "//System.out.println(historyCheckPoints.get(0));": 1513,
    "objToBeMoved": 1514,
    "this.currentMap.get(from.y()).charAt(from.x());": 1515,
    "tempString": 1516,
    "currentMap.get(from.y()).toCharArray();//for": 1517,
    "horizontal": 1518,
    "tempStringFrom": 1519,
    "currentMap.get(from.y()).toCharArray();": 1520,
    "vertical": 1521,
    "tempStringTo": 1522,
    "currentMap.get(to.y()).toCharArray();": 1523,
    "if(from.y()": 1524,
    "to.y())": 1525,
    "//horizontal": 1526,
    "movement": 1527,
    "tempString[to.x()]": 1528,
    "objToBeMoved;": 1529,
    "tempString[from.x()]=": 1530,
    "'.';": 1531,
    "this.currentMap.set(from.y(),": 1532,
    "String.valueOf(tempString));": 1533,
    "(from.y()": 1534,
    "tempStringTo[from.x()]": 1535,
    "tempStringFrom[from.x()]": 1536,
    "String.valueOf(tempStringFrom));": 1537,
    "this.currentMap.set(to.y(),": 1538,
    "String.valueOf(tempStringTo));": 1539,
    "if(historyCheckPoints.size()!=0)": 1540,
    "//this.currentMap": 1541,
    "ArrayList<>(this.checkpointMap);//this.checkpointMap;": 1542,
    "ArrayList<>(historyCheckPoints.get(historyCheckPoints.size()-1));": 1543,
    "-=": 1544,
    "historyCheckPoints.remove(historyCheckPoints.size()-1);": 1545,
    "(historyCheckPoints.size()": 1546,
    "ArrayList<>(this.map.mapArrayList);": 1547,
    "//System.out.println(\"hiiiiiiiii\");": 1548,
    "//this.remainingUndos-=1;": 1549,
    "if(gameState.getAllPlayerPositions().size()": 1550,
    "//int": 1551,
    "=1;": 1552,
    "//boolean": 1553,
    "afterfirstround": 1554,
    "renderingEngine.message(\"Sokoban": 1555,
    "//renderingEngine.render(this.state);": 1556,
    "//inputEngine.r": 1557,
    "=null;": 1558,
    "(shouldStop()!=": 1559,
    "true)": 1560,
    "//this.state.isWin()!=true": 1561,
    "stringQuota": 1562,
    "String.valueOf(this.state.getUndoQuota());": 1563,
    "stringQuota.replace(\"Optional[\",\"\");": 1564,
    "stringQuota.replace(\"]\",\"\");": 1565,
    "renderingEngine.message(\"Undo": 1566,
    "stringQuota);//\"Undo": 1567,
    "\"+String.valueOf(this.state.getUndoQuota())": 1568,
    "renderingEngine.message(\">>>\");": 1569,
    "//renderingEngine.render(state);": 1570,
    "actionResult": 1571,
    "this.processAction(temp);": 1572,
    "if(actionResult": 1573,
    "ActionResult.Success){continue;}": 1574,
    "(actionResult": 1575,
    "actionResult).getReason());": 1576,
    "if(temp": 1577,
    "Exit){break;}": 1578,
    "//if(round": 1579,
    "==3){break;};": 1580,
    "//round": 1581,
    "+=": 1582,
    "if(this.state.isWin()){": 1583,
    "renderingEngine.message(\"Game": 1584,
    "renderingEngine.message(\"You": 1585,
    "win.\");}": 1586,
    "{renderingEngine.message(\"Game": 1587,
    "exits.\");};": 1588,
    "fectchedAction": 1589,
    "(action)": 1590,
    "ActionResult.Failed(action,\"Invalid": 1591,
    "if(this.state.remainingUndos": 1592,
    "move:": 1593,
    "playerX": 1594,
    "this.state.getPlayerPositionById(action.getInitiator()).x();": 1595,
    "playerY": 1596,
    "this.state.getPlayerPositionById(action.getInitiator()).y();": 1597,
    "(move)": 1598,
    "(this.state.getEntity(new": 1599,
    "Position(": 1600,
    "playerX-1,playerY))": 1601,
    "{//empty": 1602,
    "this.state.move(new": 1603,
    "Position(playerX,playerY),new": 1604,
    "Position(playerX-1,playerY));": 1605,
    "playerX-2,playerY))": 1606,
    "Empty)//nth": 1607,
    "if(((Box)": 1608,
    "this.state.getEntity(new": 1609,
    "playerX-1,playerY))).getPlayerId()==": 1610,
    "action.getInitiator())": 1611,
    "Position(playerX-1,playerY),new": 1612,
    "Position(playerX-2,playerY));": 1613,
    "ActionResult.Success(action);}": 1614,
    "boxes.\");}": 1615,
    "}//": 1616,
    "Box\");}": 1617,
    "playerX+1,playerY))": 1618,
    "Position(playerX+1,playerY));": 1619,
    "playerX+2,playerY))": 1620,
    "playerX+1,playerY))).getPlayerId()==": 1621,
    "Position(playerX+1,playerY),new": 1622,
    "Position(playerX+2,playerY));": 1623,
    "playerX,playerY-1))": 1624,
    "top": 1625,
    "Position(playerX,playerY-1));": 1626,
    "playerX,playerY-2))": 1627,
    "playerX,playerY-1))).getPlayerId()==": 1628,
    "Position(playerX,playerY-1),new": 1629,
    "Position(playerX,playerY-2));": 1630,
    "playerX,playerY+1))": 1631,
    "Position(playerX,playerY+1));": 1632,
    "playerX,playerY+2))": 1633,
    "playerX,playerY+1))).getPlayerId()==": 1634,
    "{this.state.checkpoint();": 1635,
    "Position(playerX,playerY+1),new": 1636,
    "Position(playerX,playerY+2));": 1637,
    "tempPlayerIds": 1638,
    "this.mapArrayList.size();i++": 1639,
    "this.mapArrayList.get(i).length();j++)": 1640,
    "if(Character.isUpperCase(this.mapArrayList.get(i).charAt(j)))": 1641,
    "tempPlayerIds.add(Integer.valueOf((int)(this.mapArrayList.get(i).charAt(j)-'A')));": 1642,
    "tempPlayerIds;": 1643,
    "this.destination": 1644,
    "this.mapArrayList.get(position.y()).toCharArray();": 1645,
    "if(entity": 1646,
    "{temp[position.x()]='#';": 1647,
    "this.mapArrayList.set(position.y(),": 1648,
    "String.valueOf(temp));}": 1649,
    "temp[position.x()]='.';": 1650,
    "String.valueOf(temp));": 1651,
    "temp[position.x()]=(char)('A'+((Player)": 1652,
    "temp[position.x()]=(char)('a'+((Box)": 1653,
    "entity).getPlayerId());": 1654,
    "map.undolimit;": 1655,
    "System.out.println(\"type": 1656,
    "input:": 1657,
    "System.out.println(\"terminal\");": 1658,
    "System.out.println(inputLine);": 1659,
    "(inputLine.equals(\"exit\")){": 1660,
    "what": 1661,
    "initiator": 1662,
    "value": 1663,
    "(inputLine.equals(\"A\")){": 1664,
